<!--个险渠道---服务知情同意书页面-->
<template>
  <div class="agreeServe" >
    <div class='textBox'style="background-color: #FFFFFF;padding: 0 1.55rem 1.67rem;">
      <p class='bp'><span >服务知情同意书</span></p>
      <p class='p1'>
        泰康人寿保险有限责任公司（以下简称“泰康人寿”）和泰康健康管理（北京）有限公司（以下简称“泰康健康”）通过整合健康医疗服务资源，为用户提供齿科保健服务。
      </p>
      <p class='p1'>
        泰康人寿和泰康健康尊重所有用户的个人信息及隐私权。本“协议”是为尊重及保护所有用户个人信息及隐私所作的承诺，同时说明了泰康人寿和泰康健康对于用户个人信息所采取的收集、保存、使用和保护方式。泰康人寿和泰康健康将根据以下条件和条款为您提供服务，“协议”适用于所有泰康人寿和泰康健康开展的健康服务。请您在注册成为用户前务必仔细阅读并决定是否接受。
      </p>
      <p class='p1_h'><span class='title1'>
               一、关于使用的资格与隐私安全
        </span></p>
      <p class='p1'>
        客户是指购买了泰康人寿保险产品、并获赠齿科保健健康服务的客户。
      </p>
      <p class='p1'>
        在您使用健康服务之前，您应确保自身具备相应民事行为能力，若您不具备前述主体资格，则您及您的监护人应承担因此而导致的一切后果，泰康人寿和泰康健康不承担任何责任，且有权放弃健康服务。
      </p>
      <p class='p1'>
        泰康人寿和泰康健康在征得您的同意后，有可能与第三方专业公司进行合作，为您提供更加丰富、实用的健康服务，由此涉及的数据传输风险及个人信息安全问题，若非因泰康人寿和泰康健康造成您的损害，泰康人寿和泰康健康不承担责任。
      </p>
      <p class='p1_h'><span class='title1'>
        二、关于健康服务以及信息传播的适用范围与版权
      </span></p>
      <p class='p1'>
        泰康人寿和泰康健康所承载的具体服务和信息内容（文、图、视频、音频）均以提供有益客户健康的服务为初衷，由于健康服务需求的专业性和个性化特点，泰康人寿和泰康健康服务的内容不能确保对所有客户都能适用，因此不对其适用性做任何形式的保证。针对有个性需求客户的具体健康建议还需咨询医生或相关专业人士。
      </p>
      <p class='p1'>
        鉴于泰康人寿和泰康健康部分资源来源于其他合作方，泰康人寿和泰康健康视为已经取得了上述资源的授权使用许可，如果无意中侵犯了您的著作权，敬请告知，经核实后可在第一时间删除，泰康人寿和泰康健康对此声明有最终解释权。
    </p>
      <p class='p1'>
        标明来源为泰康人寿和泰康健康的资讯（诸如文字、图表、标识、图像、数据等），未经泰康人寿和泰康健康书面授权，任何单位或者个人不得以任何方式全部或部分复制、转载、引用、链接、抓取或者以其他方式使用。一旦发现，将追究相关机构和个人的法律责任。
        </p>
        <p class='p1_h'><span class='title1'>
         三、关于在服务中将可能收集的您的信息
      </span></p>
      <p class='p1'>当您接受齿科保健健康服务时，泰康人寿和泰康健康将在征得您同意的前提下收集您的相关个人资料，以便进行服务。您需要提供相关个人信息、资料，方可完成注册程序。</p>
      <p class='p1'>齿科保健健康服务中的健康档案功能，将可以提取客户在泰康人寿和泰康健康签约合作医疗机构中的既往健康相关数据，以形成更加完整的个人健康信息档案，方便提供个性化的健康管理方案。</p>
      <p class='p1'>您的个人信息资料可能在您首次接受健康服务时提供，也可能在以后为您提供健康服务时，根据需要补充提供。</p>
      <p class='p1'>如您所提供的相关信息、资料发生变更，您应及时更新以使之真实、完整和准确，您的信息是泰康人寿和泰康健康能够根据平台设置正常地为您提供服务的基本前提之一。如有合理理由怀疑您提供的资料错误、不实、过时或不完整，泰康人寿和泰康健康有权向您发出询问及/或要求改正的通知，并有权直接作出删除相应资料的处理，直至终止对您提供部分或全部服务，由此导致您在使用健康服务过程中产生的任何损失或增加的费用，应由您完全独自承担。</p>
      <p class='p1'>泰康人寿和泰康健康将在必要时由专业技术人员代为对您提供的相关资料进行技术处理及相关完善，以达到服务需求，在此向您告知并征得认可和同意。</p>
      <p class='p1'>当您通过您的移动设备或其他方式接入以使用泰康人寿和泰康健康的服务时，系统可能会通过cookies、web beacon或其他方式自动采集包括您所使用的设备情况或使用的软件等在内的技术信息。</p>
      <p class='p1'>在您开启设备具有的定位功能并使用泰康人寿和泰康健康基于位置信息而提供的服务时，泰康人寿和泰康健康将通过GPS或WiFi等方式收集您的地理位置信息。您可以通过关闭定位功能随时停止泰康人寿和泰康健康对您的地理位置信息的收集。</p>
      <p class='p1_h'><span class='title1'>四、关于您个人信息的后续使用</span></p>
      <p class='p1'>泰康人寿和泰康健康将在服务的过程中对所收集的您的信息用于：</p>
      <p class='p1'>- 对收集到的信息进行系统分析、归类和使用，有针对性地为您提供更优化的服务；</p>
      <p class='p1'>- 为保证为您提供服务时的安全性，用于对您的身份信息进行验证、进行必要的安全防范和诈骗监控，以及进行必要的存储与备份；</p>
      <p class='p1'>- 为您设计、向您推荐和提供可能适合您的产品和服务；</p>
      <p class='p1'>- 让您参与有关健康服务产品和服务的调查；</p>
      <p class='p1'>- 经您许可，由承担同等保密义务的泰康人寿和泰康健康的关联公司或合作的第三方向您提供网络服务。</p>
      <p class='p1_h'><span class='title1'>五、关于对您个人信息的保护原则</span></p>
      <p class='p1'>保护您的隐私是泰康人寿和泰康健康的一项基本原则，未经您的许可，泰康人寿和泰康健康保证不对外公开或向第三方提供您的注册资料及您在使用本服务或通过泰康人寿和泰康健康平台进行相关购买活动时存储在本平台的非公开内容，但下列情况除外：</p>
      <p class='p1'>- 事先获得您的明确授权；</p>
      <p class='p1'>- 根据有关的法律法规要求；</p>
      <p class='p1'>- 按照相关政府主管部门的要求；</p>
      <p class='p1'>- 为维护社会公众的利益；</p>
      <p class='p1'>- 为维护泰康人寿和泰康健康的合法权益。</p>
      <p class='p1_h'><span class='title1'>六、关于对本协议的更改</span></p>
      <p class='p1'>泰康人寿和泰康健康可能会不定期地对本“协议”进行修订。如果本“协议”在用户个人信息政策方面有修改时，会在泰康医生APP齿科服务页面中的显著位置予以提示，或通过电子邮件，或通过根据您所提供之信息中可供联系的相关方式等途径通知您，如果您选择继续使用泰康人寿和泰康健康的服务，则表示您同意接受修订后的协议；如您不同意修改后的协议，您应立即停止使用泰康人寿和泰康健康服务平台。</p>
      <p class='p1'>您了解并确认，您所提供的个人信息及资料系由您自行输入并提供，由于海量信息的存在，且泰康人寿和泰康健康无法杜绝可能存在的道德等相关风险及瑕疵，您应谨慎判断并确定相关信息的真实性、合法性和有效性。</p>
      <p class='p1_h'><span class='title1'>七、免责条款</span></p>
      <p class='p1'>任何由于计算机问题、黑客攻击、计算机病毒侵入或发作、电信部门技术管制、政府行为或其他第三人的原因而造成的暂时性关闭等影响泰康人寿和泰康健康正常运行的不可抗力而造成的个人资料泄露、丢失、被盗用或被窜改等，泰康人寿和泰康健康均得免责。</p>
      <p class='p1'>泰康人寿和泰康健康上如有与其他关联公司或合作的第三方网站网页的链接，均不对其他任何网站的内容、隐私政策或运营，或经营这些网站的主体的行为负责。当您在向这些与泰康人寿和泰康健康链接的网站提供个人信息之前，请查阅它们的隐私政策。 由于与泰康人寿和泰康健康链接的其它网站所造成之个人资料泄露及由此而导致的任何法律争议和后果，泰康人寿和泰康健康概不负责，亦不负任何法律责任。</p>
      <p class='p1_h'><span class='title1'>八、赔偿限额</span></p>
      <p class='p1'>泰康人寿和泰康健康会竭诚为您提供相关服务。但若您认为泰康人寿和泰康健康有任何违约行为或其他违法行为而向泰康人寿和泰康健康提出索赔时，您认可泰康人寿和泰康健康的最高责任限额为不超过相对应的服务费用。泰康人寿和泰康健康对您的任何间接损失不承担责任。</p>
      <p class='p1_h'><span class='title1'>九、争议管辖</span></p>
      <p class='p1'>因本协议相关或因其引起的争议，均应当使用中华人民共和国法律。因本协议引起的或与其相关的争议均应当由北京仲裁委员会仲裁解决，败诉方应承担包括胜诉方律师费在内的一切仲裁费用。</p>
      <p class='p1'>泰康人寿和泰康健康有权依据前述协议相关内容或相关法律法规向您提供服务或终止向您提供服务，且无须征得您的另行同意或另行提前通知予您。</p>
    </div>
    </div>
</template>

<script>
  import $ from 'jquery'
  export default {
    name: 'agreeServe',
    data() {
      return {
        msg: 'Welcome to Your Vue.js App'
      }
    },
    beforeCreate () {document.title = '服务知情同意书'},
    mounted() {//this.anios();
    },
    methods:{
      anios: function() { //判断移动设备，更改样式
        var u = navigator.userAgent;
        var isAndroid = u.indexOf('Android') > -1 || u.indexOf('Adr') > -1; //android终端
        var isiOS = !!u.match(/\(i[^;]+;( U;)? CPU.+Mac OS X/); //ios终端
        if(isiOS) { // ios系统样式设置
          var el =  $('.textBox');
          el.WebKitOverflowScrolling = 'auto';
          el.scrollTop = 500;
          el.WebKitOverflowScrolling = 'touch';
        }
      },
    }
  }
</script>

<style scoped>
.agreeServe{position:absolute;top:0;left:0;right:0;bottom:0;-webkit-overflow-scrolling:touch;overflow-y:scroll ;}
.bp{margin:0pt; orphans:0; text-align:center; widows:0;padding: 1rem 0;}
.b_h{font-family:微软雅黑; font-size:1rem;font-weight: 700;}
.p1{line-height:1.17rem;margin:0pt; orphans:0; text-align:justify; widows:0;font-family:微软雅黑; font-size:.78rem}
.p3{line-height:.92rem;margin:0pt; orphans:0; text-align:justify; widows:0;font-family:微软雅黑; font-size:.61rem;color: #4E4E4E;}
/*.span1{font-family:微软雅黑; font-size:.78rem}*/
.title1{font-family:微软雅黑; font-size:.89rem; font-weight:bold}
.p2{line-height:1.17rem;margin:0pt; orphans:0; text-align:justify; widows:0;font-family:微软雅黑; font-size:.78rem;font-weight:bold}
.p1_h{padding-top: 1.55rem;padding-bottom: .78rem;}
</style>